## Pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('titanic.csv')
df

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

## 3. astype()

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Gender       891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [7]:
df['Survived'].dtypes

dtype('int64')

In [8]:
df['Survived'].astype('float')

0      0.0
1      1.0
2      1.0
3      1.0
4      0.0
      ...
886    0.0
887    1.0
888    0.0
889    1.0
890    0.0
Name: Survived, Length: 891, dtype: float64

In [9]:
df['Survived'].astype('str')

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: object

In [11]:
df = pd.DataFrame({'A':np.random.randint(10,20,size=5),
                   'B':[10,30,40,20,50]})
df

    A   B
0  19  10
1  18  30
2  18  40
3  19  20
4  19  50

In [11]:
df['C'] = 'Python'
df

    A   B       C
0  15  10  Python
1  19  30  Python
2  19  40  Python
3  14  20  Python
4  16  50  Python

In [12]:
df['C'] = df['A'] + df['B']
df

    A   B   C
0  15  10  25
1  19  30  49
2  19  40  59
3  14  20  34
4  16  50  66

In [13]:
df['D'] = df['C'] + 10
df

    A   B   C   D
0  15  10  25  35
1  19  30  49  59
2  19  40  59  69
3  14  20  34  44
4  16  50  66  76

In [14]:
df['E'] = df['A'] * 5
df

    A   B   C   D   E
0  15  10  25  35  75
1  19  30  49  59  95
2  19  40  59  69  95
3  14  20  34  44  70
4  16  50  66  76  80

In [15]:
df['F'] = 'Class'
df

    A   B   C   D   E      F
0  15  10  25  35  75  Class
1  19  30  49  59  95  Class
2  19  40  59  69  95  Class
3  14  20  34  44  70  Class
4  16  50  66  76  80  Class

In [16]:
df['G'] = df['F']*2
df

    A   B   C   D   E      F           G
0  15  10  25  35  75  Class  ClassClass
1  19  30  49  59  95  Class  ClassClass
2  19  40  59  69  95  Class  ClassClass
3  14  20  34  44  70  Class  ClassClass
4  16  50  66  76  80  Class  ClassClass

In [18]:
df['H'] = df['F'] + '_' + df['D'].astype('str')
df

    A   B   C   D   E      F           G         H
0  15  10  25  35  75  Class  ClassClass  Class_35
1  19  30  49  59  95  Class  ClassClass  Class_59
2  19  40  59  69  95  Class  ClassClass  Class_69
3  14  20  34  44  70  Class  ClassClass  Class_44
4  16  50  66  76  80  Class  ClassClass  Class_76

In [19]:
df['I'] = df['F'] + '_' + str(df['D'])
df

,A,B,C,D,E,F,G,H,I
0,15,10,25,35,75,Class,ClassClass,Class_35,Class_0 35\n1 59\n2 69\n3 44\n4 ...
1,19,30,49,59,95,Class,ClassClass,Class_59,Class_0 35\n1 59\n2 69\n3 44\n4 ...
2,19,40,59,69,95,Class,ClassClass,Class_69,Class_0 35\n1 59\n2 69\n3 44\n4 ...
3,14,20,34,44,70,Class,ClassClass,Class_44,Class_0 35\n1 59\n2 69\n3 44\n4 ...
4,16,50,66,76,80,Class,ClassClass,Class_76,Class_0 35\n1 59\n2 69\n3 44\n4 ...

In [ ]:
ht = 178
wt= 78

In [ ]:
df['bmi']=(ht +wt)/5

In [20]:
# Compound_interest = A-P
# Amount = P(1+R/100)^T

Principal_amount = [100000,250000,800000,500000,700000]
Interent_rate = [12,10.5,7,13,11]
Time = [3,4,5,4,6]

In [21]:
df = pd.DataFrame({'Principal_amount':np.array(Principal_amount),
                   "Interent_rate":np.array(Interent_rate),
                   'Time':np.array(Time)})
df

   Principal_amount  Interent_rate  Time
0            100000           12.0     3
1            250000           10.5     4
2            800000            7.0     5
3            500000           13.0     4
4            700000           11.0     6

In [22]:
df['Amount'] = df['Principal_amount'] * ( 1 + df['Interent_rate']/100)**df['Time']
df

   Principal_amount  Interent_rate  Time        Amount
0            100000           12.0     3  1.404928e+05
1            250000           10.5     4  3.727255e+05
2            800000            7.0     5  1.122041e+06
3            500000           13.0     4  8.152368e+05
4            700000           11.0     6  1.309290e+06

In [23]:
df['C_I'] = df['Amount'] - df['Principal_amount']
df

   Principal_amount  Interent_rate  Time        Amount            C_I
0            100000           12.0     3  1.404928e+05   40492.800000
1            250000           10.5     4  3.727255e+05  122725.512656
2            800000            7.0     5  1.122041e+06  322041.384560
3            500000           13.0     4  8.152368e+05  315236.805000
4            700000           11.0     6  1.309290e+06  609290.186513